src/Catalogs/уатПунктыНазначения/уатПунктыНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПунктыНазначения</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автостанция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоступностиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоступностиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гараж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВМонопаллетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкаВПаллетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияПолейАдреса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениДляПоискаКоординат</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <comment>Комиссия (УАТ_Пассажирские перевозки)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент (УАТ_Пассажирские перевозки)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Лат</name>
    <comment>Широта пункта назначения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лон</name>
    <comment>Долгота пункта назначения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПеревозки</name>
    <type>
      <types>CatalogRef.уатНаправленияПеревозок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельнаяГруппировкаПриКомплектации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РадиусПоиска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <comment>Страна (уэ)</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонныйКод</name>
    <comment>Телефонный код (уэ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПункта</name>
    <type>
      <types>CatalogRef.уатТипыПунктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШифрПункта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАдреса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоянкаДоп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоянкаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКарте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускнаяСпособностьСкладаТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускнаяСпособностьСкладаКгЧ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускнаяСпособностьСкладаЕдЧ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробегВнеГеозоны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РазрешенныеТипыТС</name>
    <attributes>
      <name>ТипТС</name>
      <type>
        <types>CatalogRef.уатТипыТС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоянкаДоп</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатПунктыНазначения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипПункта) 
		И НЕ ЭтоГруппа Тогда
		ТипПункта = Справочники.уатТипыПунктов.Адрес;
	КонецЕсли;
	
	Если Не ЭтоГруппа И НЕ ЗначениеЗаполнено(ЗначениеАдреса) Тогда
		КонтактнаяИнформацияXML = ЗначенияПолейАдреса.Получить();
		Если ЗначениеЗаполнено(КонтактнаяИнформацияXML) 
			И УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(КонтактнаяИнформацияXML) Тогда
			
			ЗначениеАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(КонтактнаяИнформацияXML, Перечисления.ТипыКонтактнойИнформации.Адрес);
		ИначеЕсли ЗначениеЗаполнено(Адрес) Тогда
			СтруктураАдреса = УправлениеКонтактнойИнформациейКлиентСервер.ОписаниеНовойКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
			СтруктураАдреса.country = Строка(Справочники.СтраныМира.Россия);
			СтруктураАдреса.value = Адрес;
			
			ЗначениеАдреса = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураАдреса);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда 
		Наименование = уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_уатПунктыНазначения", ЭтотОбъект);
		Если НЕ ЗначениеЗаполнено(Наименование)
			И ЗначениеЗаполнено(Адрес) Тогда
			Наименование = Адрес;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа
		И НЕ ЗначениеЗаполнено(РадиусПоиска) Тогда
		РадиусПоиска = 100;
		
		ЗначениеУстановлено = Ложь;
		ТекПользователь     = Пользователи.АвторизованныйПользователь();
		ПодразделениеПользователь = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновноеПодразделениеОрганизации");
		Если ЗначениеЗаполнено(ПодразделениеПользователь) Тогда 
			ЗначениеНастройки = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ПодразделениеПользователь, ПланыВидовХарактеристик.уатПраваИНастройки.РадиусПоискаВПунктеМетров);
			Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда 
				РадиусПоиска        = ЗначениеНастройки;
				ЗначениеУстановлено = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеУстановлено Тогда 
			ОрганизацияПользователь = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
			Если ЗначениеЗаполнено(ОрганизацияПользователь) Тогда 
				ЗначениеНастройки = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ОрганизацияПользователь, ПланыВидовХарактеристик.уатПраваИНастройки.РадиусПоискаВПунктеМетров);
				Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда 
					РадиусПоиска = ЗначениеНастройки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа
		И НЕ ЗначениеЗаполнено(ПробегВнеГеозоны) 
		И Лат <> 0
		И Лон <> 0 Тогда 
		ПробегВнеГеозоны = уатОбщегоНазначения_уэ.ПолучитьПробегВнеГеозоны(Лат, Лон);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьСлучайныйЦветПункта() Экспорт
	ЦветНаКарте = уатЗащищенныеФункцииСервер_проф.СлучайноеЧисло(, 15);
	
	Если ЦветНаКарте = 0 Тогда 
		ЦветНаКарте = 16;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
